---
kind: method
id: M:Autodesk.Revit.DB.SATExportOptions.#ctor
source: html/2c911867-0686-5250-973a-7d73b27501bd.htm
---
# Autodesk.Revit.DB.SATExportOptions.#ctor Method

Constructs a new instance of SATImportOptions with default values of all properties.

## Syntax (C#)
```csharp
public SATExportOptions()
```